################################################################################
# VPC
################################################################################

output "vpc_id" {
  description = "作成したVPCのID"
  value       = aws_vpc.main.id
}

################################################################################
# Internet Gateway
################################################################################

output "internet_gateway_id" {
  description = "作成したインターネットゲートウェイのID"
  value       = aws_internet_gateway.main.id
}

################################################################################
# Public Subnets
################################################################################

output "public_subnet_ids" {
  description = "作成したPublic SubnetのID"
  value       = values(aws_subnet.public).*.id
}

################################################################################
# Private Subnets
################################################################################

output "private_subnet_ids" {
  description = "作成したPrivate SubnetのID"
  value       = values(aws_subnet.private).*.id
}

